<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"s3","backend":"3166568acb3525db31b1524202da44b6421b92d98e50e5dbce89173df4f5df9b","plan_job_ref":"Job Run Terraform plan in staging #111 at https://github.com/GSA-TTS/continuous-assessment-poc/actions/runs/12505975092","plan_out_hash":"2d67cc2d2579dcc23a3edcff723422d723d68172082282f7fa521970895685f6","plan_hash":"b4f38362da5939e399efcf61386eca43e81bf95333a8b8492286795219b22c9e","plan_text_format":"diff","version":"1.45.0"} -->
Terraform plan in __terraform__
With var files: `terraform/staging.tfvars`
<details>
<summary>Plan: 0 to add, 2 to change, 0 to destroy.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
!~  update in-place

Terraform will perform the following actions:

  # cloudfoundry_app.app will be updated in-place
!~  resource "cloudfoundry_app" "app" {
!~      created_at                  = "2024-12-26T15:58:48Z" -> (known after apply)
+       disk_quota                  = (known after apply)
+       health_check_type           = (known after apply)
!~      id                          = "************************************" -> (known after apply)
+       instances                   = (known after apply)
+       log_rate_limit_per_second   = (known after apply)
+       memory                      = (known after apply)
        name                        = "continuous_monitoring-staging"
+       readiness_health_check_type = (known after apply)
!~      source_code_hash            = "gKlUi9o+h4iokClxdzrjXmkEtyVv85wAb0IcJ+HfRws=" -> "F/AuqFcc51F7kFcgD+LWEtfd6GMjeoC49oK0RHTlHI8="
!~      stack                       = "cflinuxfs4" -> (known after apply)
!~      updated_at                  = "2024-12-26T16:00:57Z" -> (known after apply)
#        (9 unchanged attributes hidden)
    }

  # cloudfoundry_network_policy.egress_routing will be updated in-place
!~  resource "cloudfoundry_network_policy" "egress_routing" {
        id = "68083ad3-a0ae-5d8c-a25c-c4cfa59942b6"

-       policy {
-           destination_app = "8c507bc9-50fe-4247-88f6-b69f964f9c8c" -> null
-           port            = "61443" -> null
-           protocol        = "tcp" -> null
-           source_app      = "699701cc-75f1-4308-a9d8-476b6ea0ca03" -> null
        }
-       policy {
-           destination_app = "8c507bc9-50fe-4247-88f6-b69f964f9c8c" -> null
-           port            = "8080" -> null
-           protocol        = "tcp" -> null
-           source_app      = "699701cc-75f1-4308-a9d8-476b6ea0ca03" -> null
        }
+       policy {
+           destination_app = "8c507bc9-50fe-4247-88f6-b69f964f9c8c"
+           port            = "61443"
+           protocol        = "tcp"
+           source_app      = (known after apply)
        }
+       policy {
+           destination_app = "8c507bc9-50fe-4247-88f6-b69f964f9c8c"
+           port            = "8080"
+           protocol        = "tcp"
+           source_app      = (known after apply)
        }
    }

Plan: 0 to add, 2 to change, 0 to destroy.
```
</details>

:memo: Plan generated in [Run Terraform plan in staging #111](https://github.com/GSA-TTS/continuous-assessment-poc/actions/runs/12505975092)